#chmod用来管理文件权限的命令
语法:chmod 选项 身份 权限 文件

#选项
-c			#若指定文件的权限更改成功,才显示其更改动作
-f			#不显示错误信息
-v			#显示权限变更的详细信息
-R			#递归更改文件权限

#注意
1.linux的文件系统中有三种身份:
符号			描述
 u			自己
 g			同组的人
 o			其他人
2.对于每种身份每种身份对应着4种权限:
符号			描述
 r			可读
 w			可写
 x			可执行
 s			特殊权限
3.linux系统中还有特殊权限三种：
a.set user id(s):该文件被执行，执行者可暂时成为文件拥有者。权值为4000,设有此权限的文件其用户权限的x位会显示s.
b.set group id(s):该文件被执行，执行者暂时成为文件所在用户组。权值为2000,设有此权限的文件其所在组权限的x位会显示s.
c.sticky bit(t):该文件只能被拥有者删除.设有此权限的文件其权限序列的最后会有一个T标识.
4.对于一个文件夹x权限的含义就不再是可执行了，而是可进入。
5./tmp文件夹具有t权限,表示任何人都可以在/tmp下创建文件而且只能被自己删除.#drwxrwxrwt root root /tmp

#示例
chmod 600 file		#file的权限被设置为只能被属主读写
chmod u+t file		#file被设置为只能被属主删除

