#比较两文件之间的差异
语法:diff 选项 原文件 新文件

#常用参数
-a			#将比较的两文件视为文本文件
-b			#忽略多余空格的影响
-B			#忽略多余空行的影响
-i			#忽略大小写
-N			#如果不存在的文件视为空文件
-q			#仅报告文件是否相异,不报告详细的差异
-r			#递归的对比两个目录中的所有子目录
-s			#在两文件相同时,给予提示.默认情况不提示
-u			#采用unified context格式显示文件差异

#注意
1.diff程序的输出被称为补丁(patch),因为Linux系统中还有一个patch程序,patch 可以根据diff的输出更新原文件.
2.对diff输出中的差异比较的解读:
[原文件的行号或者行的范围][行为][新文件的行号或者行的范围]
	1d0:原文件删除第1行,根据新文件的第0行.
	2a2:原文件的第2行添加内容,内容为新文件的第2行.
	4,5c4:原文件的4,5行修改为新文件的第4行内容.
主要行为有:d-删除,a-添加,c-替换
其中,<表示原文件,>表示新文件.
3.当比较的两文件是目录时,输出为比较两目录下的各自缺失的文件.
diff file1 file2	#比较file1和file2的差异

#示例
diff -uNr A B		#比较两个文件夹下内容的差异
diff new_dir/ orig_dir/
diff -i file1 file2
diff -is file1 file2
