#用于通过查询条件查找文件
语法:find 目录 方式 查询条件 操作

#常用方式
-name		#根据文件名查找
-iname		#根据文件名查找,且忽略大小写
-size		#根据文件大小查找
-amin		#根据文件被访问的时间查找,时间单位分钟
-atime		#根据文件被访问的时间查找,时间单位小时
-cmin		#根据文件元数据的修改时间查找,时间单位分钟
-ctime		#根据文件元数据的修改时间查找,时间单位小时
-mmin		#根据文件内容被修改的时间查找,时间单位分钟
-mtime		#根据文件内容被修改的时间查找,时间单位小时
-cnewer file	#表示查找文件元数据时间比指定文件的元数据时间晚的文件
-type 种类代码	#指定种类的文件
-path		#根据文件名或者路径名查找
-regex		#根据正则表达式查找符合条件的路径名
-iregex		#同上,且忽略大小写
-maxdepth 数字	#表示从指定目录开始遍历到的最大子目录深度
-mindepth 数字	#表示从指定目录下深度为规定数值的子目录开始遍历
-perm 权限	#根据文件权限查询
-user		#根据文件拥有者名称或者UID查询

#常用操作
-print		#将查询结果答应出来,以'\n'作为分隔符
-print0		#将查询结果答应出来,以'\0'作为分隔符
-delete		#将查询结果删除
-exec 其他命令	#将查询结果交给其他命令去处理
-prune		#将查询结果排除,可以在搜索一个目录时跳过一些子目录.

#注意
1.type支持的种类有:
	符号			描述
	b			块设备文件
	c			字符设备文件
	d			目录文件
	p			管道文件
	f			一般文件
	l			符号链接文件
	s			socket文件
2.在查询条件处使用+数字,表示在数字表示范围以外的文件.-数字表示在数字指定的范围内的文件.
3.在使用find查询时可以使用多种方式和查询条件.将多个查询方式放在()之中,使用-o(or)连接,a默认情况下是且(and)关系.例如:
\(-name "*.txt" -o -name "*.sh"\)	或关系
-name "*.txt" -type f			且关系
4.通过在查询方式前加!来实现非关系
! -name "name"				非关系,表示所有名称不为name的文件
5.-ctime,-cmin中的元数据表示除文件内容以外的数据.
6.-size选项可使用的单位有:b(块=512byte),c(byte),w(word=2byte),k(kb),M(MB),G(GB)
7.-exec操作中使用{}表示查询结果,且在命令结尾处需要加;表示命令结束,且分号需要转义.
-exec后面可以跟任何一个命令,但是只能跟一个.为了将find的结果送给多个命令我们可以将这些命令写入脚本中,通过exec调用该脚本.

#示例
#从根目录开始查找有没有文件名叫做a.txt的文件
find / -name a.txt  		

find /home -size +10k   	#从/home目录开始查找大小为10K以上的文件

#在/etc目录下查找有没有10分钟内存取过的文件或目录(atime:a---access)
find /etc -amin -10    		

find / -atime -10   		#10小时内存取过得文件或者目录

#10分钟内更改过的目录或者文件(ctime:c----change)
find / -cmin -10   		

find / -ctime +10   		#10小时前更改过的文件或者目录

#在当前目录下找所有后缀为.sh的文件,并执行(-exec)删除操作.
find . -name '*.sh' -exec rm -f {} \;	

find . -cnewer file		#当前目录下比file新的文件
find . -type d			#当前目录下文件形态为目录的文件

#找出当前目录下,后缀名为txt或者pdf的文件.将结果打印出来.
find . \(-name "*.txt" -o -name "*.pdf"\) -print

#找出当前路径下,以.sh或者.exe结尾的文件.且忽略大小写
find . -iregex ".*\(\.sh\|\.exe\)$"

#更改文件拥有者
find . -type f -user user1 -exec chown user2:user2 {}\;

#查找当前目录下的所有文件,但排除.git目录下的所有内容
find . \(-path ".git" -prune\) -o \(-type f -print\)
