#在文本中查询内容 	
grep '查询目标' 查询文件 	#在查询文件中找到查询目标并显示目标所在行内容

#常用选项
-i				#忽略查询目标的大小写
-v				#查找不包含查询目标的文件
-l				#只显示包含查询目标的文件,不显示符合的行
-n				#显示符合行的行号
-q				#判断查询目标是否在查询文件中,将结果作为退出状态码:0-存在 非0-不存在
-A n				#显示目标所在行以及接下来的n行
-e				#表示查询目标可以使用正则表达式样式
-E				#表示使用扩展的正则表达式样式

#示例
grep -i A file			#显示file文件中包含[aA]的行
grep -v A file			#显示file中不包含A的行
grep -v a /home			#显示/home下不包含a的文件
grep -l xi /home		#显示/home下包含xi的文件,但不显示符合的行
grep -n a file			#显示file中含有a的行,并显示行号
grep -n a file1 file2		#显示两文件中含有a的行,并显示行号
grep -A 2 A file		#显示A所在行已经接下来的两行
grep A file			#将文件file中A所在行显示出来
grep A *			#将含有A字符的文件和行显示出来
