#ps命令用于进程管理,语法可分为system v和BSD两种风格.
ps -ax		#system v风格:选项可分开或合并,但必须以-开头
ps -a -x
ps ax		#BSD风格:选项也可分开或合并,但不可以用-开头
ps a x

#常用选项
-e		#显示所有的进程
-A		#同上
-f		#控制显示格式的选项,表示要列出完整的进程信息
-F		#控制显示格式的选项,比-f列出更多的进程信息
-l		#控制显示格式的选项,表示使用长格式
-y		#控制显示格式的选项,表示不要显示旗标.-y只能和-l合用
-a		#列出和终端有关的进程
-x		#列出所有的进程
-u		#控制显示格式的选项,表示以用户导向的角度来列出进程
-w		#控制显示格式的修饰选项,表示用较宽的行数显示进程信息,而且超过宽度的信息会被截掉.如果使用两个ww表示不限制显示宽度,不会被截断.
-j		#控制显示格式的选项,表示以工作控制的格式显示
-H		#控制显示格式的修饰选项,表示要列出进程的层次结构
-U name		#指定建立进程的使用者名称为name
-u name		#指定进程拥有的权限等同于name

#注意
1.进程和线程的区别为:
进程：
	1.正在运行着的程序
	2.进程有独立的地址空间
线程：
	1.轻量级的进程
	2.没有独立的地址空间
	3.线程不能独立存在，是由进程创建的
2.地址空间被进程读时发生错误，计算机就会产生蓝屏。通常换片内存就行
3.创建线程-linux：fork java：thread

#示例
ps  		#查看正在执行的进程以及其执行状况
ps -a  		#显示当前终端的所有进程信息
ps -u  		#以用户的格式显示进程信息
ps -x  		#显示后台进程
ps -f 3982	#显示进程号为3982的进程信息
