#用于关机,重启主机的命令
语法:shutdown 选项 时间 警告信息

#常用选项
-f			#重启但不执行fsck
-F			#重启并执行fsck
-h			#关机
-k			#只送出系统关机信息给用户,但不执行关机操作
-r			#重启
-c			#取消前一个shutdown命令
-t 秒数			#在指定时间后关机

#注意
1.fsck是Linux下一个检查和修复文件系统的程序.
2.shutdown命令执行后，会以广播的形式通知正在系统中工作的所有用户，系统将在指定的时间内关机，此时login指令被冻结，新的用户不能登录。当所有的用户从系统中注销或是指定时间已到，shutdown就发送信号给init程序，要求init程序改变系统运行级别。
3.设置多久后执行shutdown命令,有hh:mm(时:分)和+m(分)两种形式.
hh:mm表示在指定的几点几分执行命令
+m表示在指定分钟后执行命令

#示例
shutdown -h now		#现在关机
shutdown -h 23:00	#晚上11点自动关机
shutdown -h +60		#60分钟后关机
shutdown -r now		#命令重启电脑

