#对文本文件排序
语法:sort 选项 文件

#常用的选项
-b			#忽略每行前面的空格字符
-c			#检查文件是否已排序
-d			#排序时,忽略字母,数字,空格符以外的字符.按照字典序
-f			#排序时,将小写字母视为大写字母
-k 数字范围		#以文件中指定范围的字段作为排序依据
-n			#升幂排序,将比较内容视为数字.默认情况比较ascII
-o 输出文件		#指定结果的输出文件
-r			#降幂排序
-t 分隔符		#定义分隔符
-z			#将输出的分隔符设为\0

#注意
1.在使用-k比较时,如果指定的字段相同,默认按照第一个字段的大小排序.如果两次使用-k,在第一个指定的字段相同时比较第二个指定的字段.
2.默认情况下,sort使用降序排序.
3.-k选项的范围描述(n,m为数字):
n	表示第那个字段
n,m	表示第n个和第m个字段
n-m	表示从n到m的字段
4.-n选项多用于在数值的排序中,常与-k连用.-k规定了用于排序的字段范围,-n指定了按照每一字段的数值总和排序.

#示例
sort file		#对file内容做排序,按照ascII升幂的方式
sort  -d fruits
sort -d -f fruits
sort -t ' ' -k 2 -k 3 file	#以空格符作为分割,按照第二个字段大小排序,如果第二个字段相同,比较第三个字段
sort -n -t ' ' -k 3r -k 2 file	#当第三个字段相同时,按照第二个字段降序排列
sort -n file		#对file中的数值排序,file中保存数字
