#用于测量指令执行所需消耗的时间及系统资源(CPU时间,记忆体.输入输出)资讯.
语法:time 选项 命令序列

#常用选项
-o file			#用于指定结果输出到的文件.
-a file			#将输出追加到文档的末端.
-p			#按照指定格式输出结果

#注意
1.对输出中的部分字段的解释:
实际时间(real time):从命令开始执行到运行终止经历的时间.
用户cpu时间(user cpu time):花费的用户cpu时间,即在用户态下执行的时常
系统cpu时间(system cpu time):花费的系统cpu时间,即在内核态执行的时常
2.bash变量TIMEFORMAT可以规定输出的格式,可用格式有:
%E	real时间(指令执行的耗时),显示为时:分:秒
%U	使用者模式所花费的时间
%S	核心模式所花费的时间
%C	指令的参数和名称
%D	执行程序的自有资料区的平均大小
%x	指令的结束状态码
%k	此程序收到的信号数量
%W	此程序被交换到置换当的次数
%Z	系统记忆体页的大小
%P	执行指令的cpu占用比例
%K	执行指令占用的记忆体总量的大小
%w	此程序资源中断的次数
%c	此程序被迫中断的次数
3.-p的输出格式为:

time
time command/script	#显示执行完指令或者脚本之后real,user,cpu的耗时统计
