#top可以持续观察进程以及系统信息(目前系统登录信息:登录时长,在线人数,工作负载,进程统计等)
top		#动态显示系统信息

#常用选项
-u name		#查看用户name的进程
-d time		#指定top的刷新时间为time秒

#注意:
1.僵尸进程：程序由于bug或者误操作而突然停止终止，并且没有报告给其父进程即该进程已经不再使用了，但是还在占用着系统资源

2.行1top,显示系统负载情形,由左至右代表:系统现在时间,开机时间,目前登陆的用户数,过去1分钟,5分钟,15分钟等待执行的进程平均数.

3.行2tasks,显示进程的统计,由左至右代表:进程总数,正在执行的进程数,休眠的进程数,暂停的进程数,僵尸进程数.

4.行3cpu(s),显示cpu的使用率,由左至右代表:us-使用者执行的进程占用cpu的百分比,sy-核心系统内部占用cpu的百分比,ni-用renice的调整优先级的进程占用cpu的百分比,id-cpu闲置的百分比,wa-等待I/O的百分比,hi-处理硬件中断的百分比,si-处理软件中断的百分比

5.行4mem,显示目前内存的使用情形,由左至右代表:内存总量,已使用的内存量,尚未是用的内存量,缓冲区大小.

6.行5swap,显示目前交换空间的使用情形,由左至右代表:交换空间总量,已使用的交换空间量,尚未使用的交换空间,快取大小

#示例
top -u yang	#查看用户yang的进程
top -d 10	#指定系统更新进程的时间为10秒
