#用于显示当前登录系统的用户信息
语法:who 选项 参数

#常用参数
-a		#等于-b -d -l -p -r -t -T -u 选项的组合
-b		#上次系统启动时间
-d		#显示已死的进程
-h		#输出头部的标题行
-l		#显示系统登录进程
-m		#只显示当前终端信息
-p		#显示由init进程衍生的进程
-q		#列出所有已登录用户的登录名和数量
-r		#显示当前运行级别
-s		#只显示名称,线路和时间
-T		#用+,-标注用户信息状态
-u/i		#列出已登录用户信息

#注意
1.命令的输出格式为:名称 状态 线路 时间 活动 进程标识 出口 主机名
a.名称	标识用户的登录名。
b.状态	表明线路是否对每个用户都是可写的(请参阅 -T 标志)。
c.线路	标识为在 /dev 目录中查找到线路名。
d.时间	表示用户登录的时间。
e.活动	表示自从在那个用户线路上的最后一个活动发生以来的小时和分钟数。这里的一个 .（点）表明在上一分钟里的线路活动。如果线路保持静止已经超过 24 小时或自从最近系统启动以来还没有被使用，项就被标记为旧的。
f.Pid	标识用户登录 shell 的进程标识。
g.项	标识进程终止状态（请参阅 -d 标志）。要得到关于终止值的更多信息， 请参考 wait 子例程 或 /usr/include/sys/signal.h 文件。
h.出口	标识已结束进程的退出状态（请参阅 -d 标志）。
i.主机名	指出用户从其进行登录的机器名。

#示例
who		#当前登陆主机用户
who -r
who -p
