#使用zip格式的文件压缩
格式:zip 选项 压缩包名 需要压缩的文集序列

#常用选项
-m		#压缩完成有删除源文件
-r		#需要压缩的是一个目录
-j		#忽略子目录内容
-n 文件		#选择不需要压缩的文件(忽略他们)
-y		#不要压缩链接文件的源文件
-数字		#设置压缩率(1-9,9为最高压缩率)

#注意
1.zip与gz的区别
zip在处理文本文件处理方面优越
gz在处理二进制文件处理方面优越
2.-n选项的后面如果有多种格式,将每种格式之间使用:分隔

#示例
#zip后面接压缩后的文件名，在它后面输入要压缩的文件
zip file.zip *			
zip file.zip aaa bbb ccc	#将多个文件压缩到同一包中
#将a.txt压缩为file.zip文件并在压缩完成后删除源文件
zip -m file.zip a.txt
zip -r file.zip *		#将当前目录下的子目录一起压缩
zip -j file.zip *		#忽略子目录的内容
zip -n .jpg: .gif:.mpg		#将以压缩的文件或者没必要压缩的文件去掉
zip -y file.zip *		#不要压缩链接文件的原文件
zip -3 file.zip *		#按照3的压缩率压缩指定文件


-------------------------------------------------------------------
#解压缩文件夹
格式:unzip 压缩包

#常用选项
-Z		#显示压缩包内容
-l		#同上
-v		#同上

#示例
unzip file.zip			#解压目标文件
unzip -Z file.zip
unzip -l file.zip
unzip -v file.zip
